In [1]:
import pandas as pd
import sqlalchemy as sa
import psycopg2 as ps
from sqlalchemy import create_engine

In [2]:
%load_ext sql
%sql postgresql://postgres:lingga28@localhost:2828/datacamp
conn = create_engine('postgresql://postgres:lingga28@localhost/datacamp')

# 1. Exploring the database
### Exercises
Explore the tables and its columns. Which of the following quantities can't be computed?

### Instruction
### Possible Answers
- A. The number of customers from each country.
- B. The number of movies with an international award.
- C. The average rating of a movie.
- D. The number of movies with the actor Daniel Radcliffe.

Answer: B

# 2. Exploring the table renting
### Exercises
The table renting includes all records of movie rentals. Each record has a unique ID renting_id. It also contains information about customers (customer_id) and which movies they watched (movie_id). Furthermore, customers can give a rating after watching the movie, and the day the movie was rented is recorded.

### task 1
### Instruction
Select all columns from renting.

In [3]:
%%sql

SELECT *  -- Select all
FROM renting  -- From table renting
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(1, 41, 8, None, datetime.date(2018, 10, 9)),
 (2, 10, 29, 10, datetime.date(2017, 3, 1)),
 (3, 108, 45, 4, datetime.date(2018, 6, 8)),
 (4, 39, 66, 8, datetime.date(2018, 10, 22)),
 (5, 104, 15, 7, datetime.date(2019, 3, 18)),
 (6, 50, 71, 7, datetime.date(2018, 10, 9)),
 (7, 52, 21, None, datetime.date(2018, 11, 10)),
 (8, 73, 65, 10, datetime.date(2018, 6, 5)),
 (9, 78, 2, None, datetime.date(2017, 9, 3)),
 (10, 121, 43, None, datetime.date(2017, 11, 8))]

### task 2
### Instruction
Now select only those columns from renting which are needed to calculate the average rating per movie.

In [4]:
%%sql

SELECT movie_id,  -- Select all columns needed to compute the average rating per movie
       rating
FROM renting
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(8, None),
 (29, 10),
 (45, 4),
 (66, 8),
 (15, 7),
 (71, 7),
 (21, None),
 (65, 10),
 (2, None),
 (43, None)]

### task 3
### Instruction
Question
In SQL missing values are coded with null. In which column of renting did you notice null values?

Possible Answers:
- A. renting_id
- B. customer_id
- C. movie_id
- D. rating

Answer: D

# 3. Working with dates
### Exercises
For the analysis of monthly or annual changes, it is important to select data from specific time periods. You will select records from the table renting of movie rentals. The format of dates is 'YYYY-MM-DD'.

### task 1
### Instruction
Select all movies rented on October 9th, 2018.

In [5]:
%%sql

SELECT *
FROM renting
WHERE date_renting = '2018-10-09'; -- Movies rented on October 9th, 2018

 * postgresql://postgres:***@localhost:2828/datacamp
2 rows affected.

[(1, 41, 8, None, datetime.date(2018, 10, 9)),
 (6, 50, 71, 7, datetime.date(2018, 10, 9))]

### task 2
### Instruction
Select all records of movie rentals between beginning of April 2018 till end of August 2018.

In [6]:
%%sql

SELECT *
FROM renting
WHERE date_renting BETWEEN '2018-04-01' AND '2018-08-31' -- from beginning April 2018 to end August 2018
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(3, 108, 45, 4, datetime.date(2018, 6, 8)),
 (8, 73, 65, 10, datetime.date(2018, 6, 5)),
 (12, 52, 65, 10, datetime.date(2018, 6, 29)),
 (14, 8, 29, None, datetime.date(2018, 8, 3)),
 (16, 59, 59, None, datetime.date(2018, 8, 12)),
 (23, 46, 6, 9, datetime.date(2018, 4, 9)),
 (24, 57, 41, 7, datetime.date(2018, 8, 16)),
 (28, 113, 40, 7, datetime.date(2018, 4, 5)),
 (29, 102, 66, 7, datetime.date(2018, 7, 25)),
 (33, 111, 63, 8, datetime.date(2018, 7, 11))]

### task 3
### Instruction
Put the most recent records of movie rentals on top of the resulting table and order them in decreasing order.

In [7]:
%%sql

SELECT *
FROM renting
WHERE date_renting BETWEEN '2018-04-01' AND '2018-08-31'
ORDER BY rating -- Order by recency in decreasing order
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(444, 120, 59, 3, datetime.date(2018, 8, 10)),
 (200, 86, 46, 3, datetime.date(2018, 8, 26)),
 (3, 108, 45, 4, datetime.date(2018, 6, 8)),
 (71, 111, 1, 5, datetime.date(2018, 7, 21)),
 (207, 52, 25, 5, datetime.date(2018, 4, 3)),
 (561, 113, 36, 5, datetime.date(2018, 6, 29)),
 (409, 46, 36, 5, datetime.date(2018, 6, 17)),
 (147, 58, 64, 5, datetime.date(2018, 6, 27)),
 (102, 92, 66, 6, datetime.date(2018, 8, 18)),
 (83, 120, 61, 6, datetime.date(2018, 8, 26))]

# 4. Selecting movies
### Exercises
The table movies contains all movies available on the online platform.

### task 1
### Instruction
Select all movies which are not dramas.

In [8]:
%%sql

SELECT *
FROM movies
WHERE genre <> 'Drama' -- All genres except drama
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(1, "One Night at McCool's", 'Comedy', 93, 2001, Decimal('2.09')),
 (3, 'What Women Want', 'Comedy', 127, 2001, Decimal('2.59')),
 (5, 'The Fellowship of the Ring', 'Science Fiction & Fantasy', 178, 2001, Decimal('2.59')),
 (6, "Harry Potter and the Philosopher's Stone", 'Science Fiction & Fantasy', 152, 2001, Decimal('2.69')),
 (7, 'The Royal Tenenbaums', 'Comedy', 110, 2002, Decimal('1.89')),
 (8, 'Waking Up in Reno', 'Comedy', 91, 2002, Decimal('2.59')),
 (11, 'Showtime', 'Comedy', 95, 2002, Decimal('1.79')),
 (12, 'The Two Towers', 'Science Fiction & Fantasy', 179, 2002, Decimal('2.39')),
 (13, 'Harry Potter and the Chamber of Secrets', 'Science Fiction & Fantasy', 161, 2002, Decimal('1.79')),
 (14, 'The Recruit', 'Mystery & Suspense', 115, 2003, Decimal('1.69'))]

### task 2
### Instruction
Select the movies 'Showtime', 'Love Actually' and 'The Fighter'.

In [9]:
%%sql

SELECT *
FROM movies
WHERE title IN ('Showtime', 'Love Actually', 'The Fighter'); -- Select all movies with the given titles

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[(11, 'Showtime', 'Comedy', 95, 2002, Decimal('1.79')),
 (20, 'Love Actually', 'Comedy', 135, 2003, Decimal('2.29')),
 (53, 'The Fighter', 'Other', 116, 2010, Decimal('2.49'))]

### task 3
### Instruction
Order the movies by increasing renting price.

In [10]:
%%sql

SELECT *
FROM movies
ORDER BY renting_price DESC -- Order the movies by increasing renting price
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(51, 'Morning Glory', 'Comedy', 107, 2010, Decimal('2.99')),
 (9, "11'09''01 September 11", 'Drama', 134, 2002, Decimal('2.99')),
 (32, 'A Good Woman', 'Drama', 93, 2006, Decimal('2.89')),
 (48, 'Astro Boy', 'Action & Adventure', 94, 2009, Decimal('2.89')),
 (52, 'Fair Game', 'Drama', 108, 2010, Decimal('2.89')),
 (25, 'Bridget Jones - The Edge of Reason', 'Drama', 108, 2004, Decimal('2.89')),
 (24, 'Welcome to Mooseport', 'Comedy', 110, 2004, Decimal('2.89')),
 (64, 'Cloud Atlas', 'Drama', 172, 2012, Decimal('2.89')),
 (54, 'Harry Potter and the Deathly Hallows – Part 1', 'Science Fiction & Fantasy', 146, 2010, Decimal('2.79')),
 (29, 'Two for the Money', 'Drama', 122, 2005, Decimal('2.79'))]

# 5. Select from renting
### Exercises
Only some users give a rating after watching a movie. Sometimes it is interesting to explore only those movie rentals where a rating was provided.

### Instructions
- Select from table renting all movie rentals from 2018.
- Filter only those records which have a movie rating.

In [11]:
%%sql

SELECT *
FROM renting
WHERE date_renting BETWEEN '2018-01-01' AND '2018-12-31' -- Renting in 2018
AND rating IS NOT NULL -- Rating exists
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(3, 108, 45, 4, datetime.date(2018, 6, 8)),
 (4, 39, 66, 8, datetime.date(2018, 10, 22)),
 (6, 50, 71, 7, datetime.date(2018, 10, 9)),
 (8, 73, 65, 10, datetime.date(2018, 6, 5)),
 (12, 52, 65, 10, datetime.date(2018, 6, 29)),
 (21, 30, 60, 10, datetime.date(2018, 2, 20)),
 (23, 46, 6, 9, datetime.date(2018, 4, 9)),
 (24, 57, 41, 7, datetime.date(2018, 8, 16)),
 (26, 118, 27, 8, datetime.date(2018, 12, 1)),
 (28, 113, 40, 7, datetime.date(2018, 4, 5))]

# 6. Summarizing customer information
### Exercises
In most business decisions customers are analyzed in groups, such as customers per country or customers per age group.

### task 1
### Instruction
Count the number of customers born in the 80s.

In [12]:
%%sql

SELECT count(customers) -- Count the total number of customers
FROM customers
WHERE date_of_birth BETWEEN '1980-01-01' AND '1989-12-31'; -- Select customers born between 1980-01-01 and 1989-12-31

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(32,)]

### task 2
### Instruction
Count the number of customers from Germany.

In [13]:
%%sql

SELECT count(country)   -- Count the total number of customers
FROM customers
WHERE country = 'Germany'; -- Select all customers from Germany

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(0,)]

### task 3
### Instruction
Count the number of countries where MovieNow has customers.

In [14]:
%%sql

SELECT COUNT(DISTINCT country)   -- Count the number of countries
FROM customers;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(11,)]

# 7. Ratings of movie 25
### Exercises
The movie ratings give us insight into the preferences of our customers. Report summary statistics, such as the minimum, maximum, average, and count, of ratings for the movie with ID 25.

### Instructions
- Select all movie rentals of the movie with movie_id 25 from the table renting.
- For those records, calculate the minimum, maximum and average rating and count the number of ratings for this movie.

In [15]:
%%sql

SELECT min(rating) AS min_rating, -- Calculate the minimum rating and use alias min_rating
	   max(rating) AS max_rating, -- Calculate the maximum rating and use alias max_rating
	   avg(rating) AS avg_rating, -- Calculate the average rating and use alias avg_rating
	   count(rating) AS number_ratings -- Count the number of ratings and use alias number_ratings
FROM renting
WHERE movie_id = 25; -- Select all records of the movie with ID 25

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(5, 10, Decimal('7.5000000000000000'), 8)]

# 8. Examining annual rentals
You are asked to provide a report about the development of the company. Specifically, your manager is interested in the total number of movie rentals, the total number of ratings and the average rating of all movies since the beginning of 2019.

### task 1
### Instruction
First, select all records of movie rentals since January 1st 2019.

In [17]:
%%sql

SELECT * -- Select all records of movie rentals since January 1st 2019
FROM renting
WHERE date_renting >= '2019-01-01'
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(5, 104, 15, 7, datetime.date(2019, 3, 18)),
 (17, 22, 46, 10, datetime.date(2019, 2, 16)),
 (18, 36, 39, 10, datetime.date(2019, 3, 20)),
 (27, 7, 36, None, datetime.date(2019, 3, 14)),
 (32, 8, 42, 10, datetime.date(2019, 2, 13)),
 (35, 91, 7, 8, datetime.date(2019, 3, 27)),
 (40, 39, 27, 8, datetime.date(2019, 3, 22)),
 (42, 31, 43, 6, datetime.date(2019, 2, 26)),
 (43, 109, 35, None, datetime.date(2019, 1, 22)),
 (44, 62, 52, 6, datetime.date(2019, 1, 4))]

### task 2
### Instruction
Now, count the number of movie rentals and calculate the average rating since the beginning of 2019.

In [18]:
%%sql

SELECT 
	count(*), -- Count the total number of rented movies
	avg(rating) -- Add the average rating
FROM renting
WHERE date_renting >= '2019-01-01';

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(159, Decimal('7.9462365591397849'))]

### task 3
### Instruction
Use as alias column names number_renting and average_rating respectively.

In [19]:
%%sql

SELECT 
	COUNT(*) as number_renting, -- Give it the column name number_renting
	AVG(rating) as average_rating  -- Give it the column name average_rating
FROM renting
WHERE date_renting >= '2019-01-01';

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(159, Decimal('7.9462365591397849'))]

### task 4
### Instruction
Finally, count how many ratings exist since 2019-01-01.

In [20]:
%%sql

SELECT 
	COUNT(*) AS number_renting,
	AVG(rating) AS average_rating, 
    COUNT(rating) AS number_ratings -- Add the total number of ratings here.
FROM renting
WHERE date_renting >= '2019-01-01';

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(159, Decimal('7.9462365591397849'), 93)]